// Общими требованиями к лабораторной работе являются:
// 1) указывать  имена входного  и  выходного   файлов   через командную строку или с клавиатуры в процессе работы программы;
// 2) обрабатывать ошибки открытия файлов;
// 3) ориентироваться на кодировку ANSI (1251);
// 3) не использовать  стандартные функции работы со  строками и символами
//  COPY, POS, Str, Val и т. п. из ПАСКАЛя;
//  stoi, to_string, substr, strstr, find, regex и т. п.  из C++;
// 4) иметь возможность работы с текстами на русском языке;
// 5) не переписывать файл в оперативную память целиком.

// 16. В   некотором   институте   приобретаемые    компьютеры выделяются   различным   факультетам  поочередно.  
// В  пределах факультетов имеются очереди из кафедр.  
// Факультет,  получивший компьютер,  перемещается  в  конец очереди,  а соответствующая кафедра   исключается   из   факультетской   очереди. 
// Вновь организованные факультеты и кафедры занимают последние места в соответствующих очередях.  
// Составить программу ведения очереди на компьютеры (9).

#include <iostream>
#include <fstream>

int main() {
    //
}
