// Общими требованиями к лабораторной работе являются:
// 1) указывать  имена входного  и  выходного   файлов   через командную строку или с клавиатуры в процессе работы программы;
// 2) обрабатывать ошибки открытия файлов;
// 3) ориентироваться на кодировку ANSI (1251);
// 3) не использовать  стандартные функции работы со  строками и символами
//  COPY, POS, Str, Val и т. п. из ПАСКАЛя; 
//  stoi, to_string, substr, strstr, find, regex и т. п.  из C++;
// 4) иметь возможность работы с текстами на русском языке;
// 5) не переписывать файл в оперативную память целиком.


// 19. Строки текстового  файла  содержат  фамилии  студентов. 
// Определить   порядковый   номер   байта,  начиная  с  которого располагается первая  по  алфавиту  фамилия.  
// Заменить  данную фамилию  в исходном файле символами '*',  не переписывая этого файла (8).


